[{"Title": "Sony Confirms PS5 Slim for This Holiday Season", "Url": "https://www.ign.com/articles/sony-confirms-ps5-slim-for-this-holiday-season", "Source": "IGN", "Content": "Sony has confirmed the heavily rumoured PlayStation 5 slim, which is due out for this holiday season. The smaller PS5 design comes with 1TB storage for the PS5 and PS5 Digital Edition, up from 825GB in the original versions of the console, and the new model provides the option to add an Ultra HD Blu-ray Disc Drive to PS5 Digital Edition. In a post on the PlayStation Blog, Sid Shuman, Senior Director, SIE Content Communications, said Sony created this new PS5 \"to address the evolving needs of players\". \"Our engineering and design teams collaborated on a new form factor that provides greater choice and flexibility,\" Shuman said. \"The same technology features that make PS5 the best to play are packed into a smaller form factor, along with an attachable Ultra HD Blu-ray Disc Drive and a 1TB SSD for more internal storage.\" The new PS5 has been reduced in volume by more than 30%, and weight by 18% and 24% compared to the previous models, Sony said. There are four separate cover panels, with the top portion in a glossy look, while the bottom remains in matte. If you buy the PS5 Digital Edition, you can add the Ultra HD Blu-ray Disc Drive for PS5 later, as it will also be sold separately for $79.99 | €119.99 | £99.99 | 11,980 JPY. The new PS5 model will be available starting this November in the U.S. at select local retailers and direct.playstation.com where available, Sony added. It will continue to roll out globally in the months that follow. Once inventory of the current PS5 model has sold out, the new PS5 will become the only model available. Here are the recommended retail prices for the new PS5 model, beginning with the rollout in November at participating retailers: It's worth noting the PS5 Digital model has gone up in price with the introduction of the slim version. The original PS5 Digital Edition costs $399.99, whereas this slimmer PS5 Digital Edition costs $449.99. This means the slimmer PS5 with a disc drive costs $50 more than the slimmer PS5 Digital Edition. A horizontal stand is included with the new PS5 model. A new vertical stand compatible with all PS5 models will be sold separately at $29.99 | €29.99 | £24.99 | 3,980 JPY. And here are the specifications for the new PS5 models: PlayStation 5 specifications PlayStation 5 Digital Edition Specifications Daniel Ahmad, Director of Research & Insights at Niko Partners, tweeted to say \"this is more indicative of Sony's current thinking around its approach for next gen\". \"If the new Digital Edition does gain traction and we see a continued trajectory of increased digital software sell through, then I wouldn't be surprised if Sony makes digital + disc drive add on the default option for next gen.\" Piers Harding-Rolls, games industry analyst at Ampere, added: \"With the ability to upgrade the new Digital Edition of the PS5, Ampere expects there to be a larger share of total sales for this version versus the previous. Ampere data shows that the share of sell-through for the Digital Edition up to the end of June 2023 was only 16%. More gamers buying into the digital edition of the console will drive more sales of digital games through the PlayStation storefront. This will drive more storefront revenue for Sony and support its profit margin objectives.\" Wesley is the UK News Editor for IGN. Find him on Twitter at @wyp100. You can reach Wesley at wesley_yinpoole@ign.com or confidentially at wyp100@proton.me.", "Summary": "Sony has confirmed the PlayStation 5 slim, which is due out for this holiday season. The smaller PS5 design comes with 1TB storage for the PS5 and PS5 Digital Edition, up from 825GB in the original versions of the console. The new PS5 has been reduced in volume by more than 30%, and weight by 18% and 24% compared to the previous models, Sony said. It will be available starting this November in the U.S. at select local retailers and direct.playstation.com where available, Sony added. Once inventory of the current PS5 model has sold out, thenew PS5 will become the only model available. It's worth noting the PS 5 Digital model has gone up in price with the introduction of the slim version."}, {"Title": "Weight loss drugs haven’t hurt Pepsi’s business, CEO says", "Url": "https://www.cnn.com/2023/10/10/business/pepsi-third-quarter-earnings/index.html", "Source": "CNN", "Content": "Markets   Fear & Greed Index                Latest Market News          Snack and beverage maker PepsiCo has so far seen “negligible” impact on its business from drugs used for weight loss or diabetes, CEO Ramon Laguarta said during an analyst call Tuesday.            Still, he said, the company is keeping an eye on them: “We’re observing the growth of these new drugs and its potential impact.”            Some food analysts have warned that long-term adoption of semaglutide drugs like Ozempic and Wegovy, which generally work by suppressing appetites, could meaningfully alter the consumption habits of shoppers. Food companies, they say, need to prepare for that possibility.            About 1.7% of America’s population was prescribed a semaglutide drug in 2023 — up 40-fold in the past five years. Already, its popularity has buoyed the economy of Denmark, where Novo Nordisk, maker of Wegovy and Ozempic, is based. It has also strained supply in the United States, even as researchers find evidence of troubling side effects. It’s still early days but, if widely adopted, the drugs could significantly change people’s health, and how they eat.            Even before these drugs entered the market, most large food makers have been reworking their portfolios to offer smaller sizes and healthier options. PepsiCo has been doing the same, and these changes could help if obesity drugs end up having a significant impact, Laguarta said.            “Our portfolio strategy, we think, is very solid when it comes to potential protection against … some of these future developments,” he said, pointing to efforts to reduce fat, sugar and salt in snacks and beverages, as well as selling products in smaller packages. He also noted that there are still several questions around the staying power of the drugs.            There could even be positive impacts, PepsiCo CFO Hugh Johnston said on CNBC Tuesday morning.           “I think anything that’s good for human health is actually good for the company in the long run,” he said. “People are going to want to continue to snack in some form or another,” he said. If needed, he added, PepsiCo will adapt its product offerings to changing tastes.      Ozempic is on the rise. That could be a problem for food companies          Already, the company has seen success with reduced sizes, which appeal to customers who want help with portion control or can’t afford larger packages.            “Consumer preferences have continued to evolve towards smaller packages,” executives said in prepared remarks Tuesday discussing the company’s third-quarter results.            Sales of smaller packages have helped the company deal with declines in volume, Laguarta said. Higher prices are also helping.            Price hikes for PepsiCo products boosted the company’s bottom line in the third quarter.            The snack and beverage giant said it increased prices globally by 11% on average, helping nudge revenue higher than analysts’ expectations, despite PepsiCo’s volume falling 2.5%. Net sales for the third quarter rose nearly 7% to $23.45 billion.            As a result, PepsiCo hiked its full-year forecast, the third consecutive quarter it has done that. The company now expects earnings per share to be $7.54, an increase from $7.20 per share when it first released the forecast in February.            Shares of PepsiCo (PEP) rose nearly 2% Tuesday morning.           Similar to other food companies, Pepsi has increased prices to mitigate inflation. However, there’s been some improvement for US consumers, with grocery price increases slowing down in August, up just 0.2% for the month. The September Consumer Price Index will provide a new reading on inflation on Thursday.           Pepsi said that in North America, sales for Gatorade, Bubly sparkling water and sodas also rose. The company also announced that it plans to relaunch the Baja Blast, a fan-favorite soda it created with Taco Bell, in three different varieties including a zero sugar version.            Consumers should also expect to see the new Pepsi logo, unveiled last March, on its products soon.     Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited. © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.", "Summary": "PepsiCo CEO says obesity drugs have so far had \"negligible\" impact on business. Some food analysts have warned that long-term adoption of Ozempic and Wegovy could alter consumption habits. If widely adopted, the drugs could significantly change people’s health, and how they eat. Price hikes for PepsiCo products boosted the company's bottom line in the third quarter.. Shares of PepsiCo (PEP) rose 2% Tuesday morning. The Consumer Price Index for the month of September will provide a new reading on inflation on Thursday. The company also announced that it plans to relaunch Baja Blast, a sparkling water and sodas brand, in the U.S. in the coming months."}, {"Title": "Sophie Turner and Joe Jonas Reach Temporary Child Custody Agreement Amid Legal Battle", "Url": "https://www.eonline.com/news/1387499/sophie-turner-and-joe-jonas-reach-temporary-child-custody-agreement-amid-legal-battle", "Source": "Eonline.com", "Content": "Sophie Turner and Joe Jonas are working on a plan for co-parenting their two lovebugs.  As the Game of Thrones star and the singer work through the details of their divorce, one of the major points of contention has been whether daughters Willa, 3, and their 14-month-old whose initials have been revealed as DMJ, will reside in the U.S., where their dad is from, or their mom's native U.K. And after agreeing to not to move their daughters out of the greater New York City area in late Sept. amid mediation, the estranged couple have reached a more detailed interim agreement.  According to legal documents obtained by E! News on Oct. 10, \"due to the ongoing and productive nature of mediation,\" Joe and Sophie have agreed to split the next few months equally between them \"in anticipation of an amicable resolution of all issues being reached.\" And this arrangement, in effect through early Jan. 2024, includes how they'll split custody over the holidays. Sophie will have their daughters between Oct. 9 and 21, during which time she's allowed to bring them to the United Kingdom, then Joe will have the two girls until Nov. 2. The actress will subsequently have custody again until Nov. 22, with Joe having the girls for Thanksgiving and through Dec. 16, before once again going to Sophie through Jan. 7—with the 27-year-old having custody through Christmas and New Year's.  E! News has reached out to reps for both Joe and Sophie but has not received an immediate response.  This temporary custody agreement—in place until a final settlement is reached—comes after Sophie filed a lawsuit against the Jonas Brothers member last month alleging that the 34-year-old was preventing their children, who are citizens in both the U.S. and U.K., from returning to \"their habitual residence of England\" by withholding their passports.  The Do Revenge star's lawsuit claimed jurisdiction under the International Child Abduction Remedies Act, a point which Joe's rep adamantly condemned.  \"The children were not abducted,\" the rep shared with E! News at the time of the suit's filing. \"After being in Joe's care for the past three months at the agreement of both parties, the children are currently with their mother. Sophie is making this claim only to move the divorce proceedings to the UK and to remove the children from the U.S. permanently. [Joe's] wish is that Sophie reconsider her harsh legal position and move forward in a more constructive and private manner. His only concern is the well-being of his children.\" Joe had officially filed for divorce from Sophie on Sept. 5, with the two sharing a joint statement to Instagram the following day.  \"After four wonderful years of marriage we have mutually decided to amicably end our marriage,\" read their Sept. 6 message. \"There are many speculative narratives as to why but, truly this is a united decision and we sincerely hope that everyone can respect our wishes for privacy for us and our children.\" And to look back on Joe and Sophie's best red carpet moments from their time together, keep reading.  Your source for entertainment news, celebrities, celeb news, and ​celebrity gossip. Check out the hottest fashion, photos, movies and TV shows! © 2023 E! Entertainment Television, LLC A Division of NBCUniversal. All rights reserved.", "Summary": "Sophie Turner and Joe Jonas have reached an interim custody agreement. The couple will split the next few months equally between them. The arrangement is in effect until a final settlement is reached. Sophie filed a lawsuit against Joe last month, claiming he was preventing their children from returning to their native U.K. Joe's rep said the children were not \"abducted\" and that he's only concerned for their \"well-being\" The Jonas Brothers member officially filed for divorce from Turner on Sept. 5, with the two sharing a joint statement on Instagram the following day, saying they had \"mutually decided to amicably end our marriage\" The two have two daughters, Willa, 3, and DMJ, 14 months."}, {"Title": "Fed may leave interest rates untouched at next meeting because surging bond yields are doing the bank’s work for it, two officials say", "Url": "https://fortune.com/2023/10/10/federal-reserve-philip-jefferson-interest-rates-bond-yields/", "Source": "Fortune", "Content": "Two Federal Reserve officials suggested Monday that the central bank may leave interest rates unchanged at its next meeting in three weeks because a surge in long-term interest rates has made borrowing more expensive and could help cool inflation without further action by the Fed. Since late July, the yield, or rate, on the 10-year U.S. Treasury note has jumped from around 4% to about 4.8%, a 16-year high. The run-up in the yield has inflated other borrowing costs and raised the national average 30-year mortgage rate to 7.5%, according to Freddie Mac, a 23-year high. Business borrowing costs have also risen as corporate bond yields have accelerated. Philip Jefferson, vice chair of the Fed’s board and a close ally of Chair Jerome Powell, said in a speech Monday to the National Association for Business Economics that he would “remain cognizant” of the higher bond rates and “keep that in mind as I assess the future path of policy.” U.S. stock prices reversed their losses after Jefferson’s comments. The S&P 500 was up 0.5% in late trading. Jefferson’s comments followed a speech to the NABE earlier in the day by Lorie Logan, president of the Federal Reserve Bank of Dallas and a voting member of the Fed’s rate-setting committee. She also indicated that higher long-term bond rates could help serve the central bank’s efforts to slow inflation to its 2% target. Since March of last year, the Fed has raised its benchmark short-term rate 11 times, from near zero to roughly 5.4%. The rate hikes have been intended to defeat the worst bout of inflation in more than 40 years. But they have also led to much higher borrowing rates and sparked worries that they could trigger a recession. “If long-term interest rates remain elevated” because investors are increasingly concerned about the risks of holding long-term bonds, “there may be less need to raise the fed funds rate,” Logan said, referring to the Fed’s benchmark rate. Bond rates rise when investors find them riskier to buy or hold. And last Thursday, Mary Daly, president of the San Francisco Fed, said that if longer-term interest rates remain high, “the need for us to take further action is diminished.” The Fed officials’ remarks coincide with increasing expectations in financial markets that the Fed will skip rate hikes at its meeting Nov. 1, as well as at the following meeting Dec. 13, and simply leave its benchmark rate at its current high level through the end of this year. Futures markets have priced in only a 12% chance of a rate hike in November and 26% in December, both significantly lower than on Friday, when a surprisingly robust jobs report was released. Fed officials have not pushed back against those expectations in their remarks, a sign they may not disagree with them at the moment. “There’s this growing sense of comfort among Fed officials with the July rate hike having been the last one in this tightening cycle and now focusing on how long to keep monetary policy at the current restrictive level,” said Gregory Daco, chief economist at EY, the accounting and consulting firm. One issue that economists and Fed officials are trying to determine is what factors are pushing longer-term rates higher. The Fed’s rate hikes themselves don’t automatically translate into higher longer-run borrowing costs, such as the 10-year Treasury yield. Market forces, expectations for future inflation and for future economic growth also affect yields. Logan noted that if longer-term rates are rising mostly because investors expect the economy to grow more quickly in the future, the Fed might have to keep lifting their short-term rate to cool the economy. But analysts increasingly think that the 10-year rate is rising because investors see greater volatility in inflation and the economy and consider holding longer-term bonds to be more risky. In that case, the Fed doesn’t necessarily have to do more to cool the economy. Another issue bedeviling Fed officials is how long it may take from the time they hike short-term rates until those higher rates impact the economy. The economist Milton Friedman said in the 1960s that the Fed’s policies work with “long and variable lags,” and yet now Fed officials disagree with how long they are. Logan, like Fed governor Christopher Waller, said she thinks much of the impact of the Fed’s rate increases have already occurred, as businesses have reacted quickly because Powell and other Fed officials issued clear warnings that rates were likely to rise quickly. But Jefferson noted the large amount of corporate debt that was refinanced at very low interest rates during the pandemic, and said that businesses would have to refinance it in coming years at higher rates, potentially slowing growth. Jefferson said that when thinking about future interest rate decisions, he would have to keep in mind all the rate hikes the Fed has imposed, that have yet to hit the economy, “and that could influence what I think should happen next.” © 2023 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information | Ad Choices FORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. S&P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Terms & Conditions. Powered and implemented by Interactive Data Managed Solutions.", "Summary": "Since late July, the yield, or rate, on the 10-year U.S. Treasury note has jumped from around 4% to about 4.8%. The run-up in the yield has inflated other borrowing costs and raised the national average 30-year mortgage rate to 7.5%, a 23-year high. Business borrowing costs have also risen as corporate bond yields have accelerated. The Fed has raised its benchmark short-term rate 11 times, from near zero to roughly 5.4%. The rate hikes have been intended to defeat the worst bout of inflation in more than 40 years. But they have also led to much higher borrowing rates and sparked worries that they could trigger a recession. the Federal Reserve Bank of Dallas and a voting member of the Fed’s rate-setting committee."}, {"Title": "Some of our favorite devices are on sale for Amazon Prime Day.", "Url": "https://www.theverge.com/23903734/amazon-october-prime-day-verge-favorites-tech-pets-travel-2023", "Source": "The Verge", "Content": "By  Barbara Krasnoff, a reviews editor who manages how-tos. She’s worked as an editor and writer for almost 40 years. Previously, she was a senior reviews editor for Computerworld. If you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement. Amazon’s fall Prime Day event is underway, for more deals we recommend across all categories, check out our full roundup here. Every month or so, we like to ask our staff about their favorite stuff — whether it’s pet toys, travel aids, kitchen gadgets, or straightforward tech.  And the results are usually very different, very interesting, and a lot of fun. Since Amazon is currently pushing a lot of deals through its current Prime Day sales, we looked through some of our recent “favorites” articles and found deals on a lot of the tech, kitchen tools, travel aids, and pet toys we like. So we thought we’d list a few in case you have read about them in the past and thought, well, that sort of sounds good, but it’s a bit pricey. (Or — that’s pretty cheap, but maybe I’ll wait until the price goes down some more...) So here are some of our staff’s most-liked gear and gadgets. Alex Cranz, managing editor A 46-piece screwdriver kits that can help you repair practically any tech device out there. I own at least two of these little Tekton Everybit Tech Rescue Kits, and I frequently buy them for friends and family, too, because for an average price of $35, you get a screwdriver with nearly every bit you’d need for most gadgets (including the weird ones for Apple products), a plastic and a metal spudger, tweezers, and a suction cup. I’ve replaced batteries in iPhones with this kit. I’ve built entire PCs with this kit. I’ve swapped out backplates on Steam Decks and housings of Joy-Con controllers with one of these kits. I’ve even used it to repair my eyeglasses. One of the best parts of the kit is it all goes in a single case that can be tossed in a computer bag or purse or be left in a desk drawer at the office. But honestly, the main reason I love it is the selection and quality of the bits. Too often, precision screwdrivers have super soft bits that strip the first time you use them with a screw that’s been tightened by a machine. Given that most gadgets have at least one too-tight screw, I’ve gone through quite a few cheap screwdriver kits before I settled on this one. While I’m slowly building out a high-quality selection of precision screwdrivers, most people don’t have that luxury or necessity. This is a great alternative — plus, you feel like kind of a badass when someone asks you to help fix a gadget, and you just pull this kit out of your bag in the middle of Starbucks and get to work.  Dan Seifert, deputy editor Hoto’s electric screwdriver is perfect for making small to medium-sized repairs around the house. In addition to a USB-C port, the screwdriver comes with a case and 12 steel bits. Cranz can talk all she wants about that little screwdriver kit, but I’m here to say the Hoto electric screwdriver is one of the best cheap tools you can keep in your kitchen gadget drawer. It’s compact, comes with enough bits to cover anything you might need, and is ridiculously powerful — I’ve used it to drill screws into walls without bothering with a pilot hole. It also charges over USB-C and has a handy light when it turns on to help you see where you’re screwin’. My only complaint is that the bits themselves are stored in the case and not on the screwdriver itself, but at this price, there’s really little to find fault with here. This screwdriver is so nice I’ve now bought it twice — because once he saw mine, my father-in-law insisted on having one, so it was an easy Father’s Day gift. Emilia David, reporter A cutting tool with a ceramic blade that’s quick, easy and safe. I admit TikTok made me buy this small safety cutter, but it’s been indispensable to someone who may or may not have an online shopping addiction. The Slice Micro Ceramic Blade safety cutter’s tiny blade cuts through paper packaging tape cleanly, opens plastic wrapping, and keeps me from going insane opening blister packaging. It doesn’t damage whatever is inside, which unfortunately happens very often with my regular metal box cutter.  The downside is that it’s so small you may lose track of it if not in use, but it does have a handy dandy hole for a keyring and a built-in magnet. And while it doesn’t fully slice through a cardboard box, it will still leave a scratch, although that could ultimately damage the ceramic blade if not used properly. I’ve had my Slice Micro for a few months, so I’m not worried about it dulling yet, but it is unclear if the blade is replaceable.  Kaitlin Hatton, audience manager An under-desk dual headphone hanger that uses 3M adhesive for mounting and an included Velcro strap to anchor a headphone cable. I gave this a try for one of our TikTok videos, and it has not disappointed me yet. I use it to hold my Razer Kraken headset and some extra cords. It’s small enough to remain out of the way but large enough to hold more than the headset itself. It has a pretty strong hold and doesn’t give, even as I raise my standing desk up and down several times a day. It’s not the prettiest accessory one can attach to their desk, but it is highly functional.  Jess Weatherbed, news writer Charge your iPhone, Apple Watch, and AirPods all at once with this three-in-one charging dock. I got this as a birthday present from my partner after several months of arguing over our sleeping arrangements. Something about me trailing the charging cables for my devices in the bed being “dangerous” and “extremely uncomfortable”... Anyway, after begrudgingly acknowledging my poor charging habits, I have to admit that having this on my desk has had benefits outside of not garroting myself mid-slumber.  My iPhone, Apple Watch, and wireless earbuds rarely run out of juice, as I no longer fall asleep before plugging them in. I’ve also taken to using the charger’s upright positioning for phones to my advantage — serving as a desk clock, a tiny display for Slack or Discord, and as a hub to remotely control the various smart devices around my home. It helps me separate the device from being my phone and instead helps me build the habit of it being another tool to boost my productivity.  Victoria Song, senior reviewer A 5.5-cup-capacity rice cooker and warmer that not only cooks rice but also comes with a steaming basket to double as a steamer and a cake menu setting to bake cakes. A lot of people will tell you that rice cookers are single-use appliances meant only for rice — they’re wrong. A rice cooker is best at cooking rice, but it can do a lot of the same things as an Instant Pot. For instance, you can use it to cook hardboiled eggs or oatmeal, steam vegetables, make porridge, make one-pot meals, and even bake a cake.  I grew up with giant 10-cup rice cookers at home, but I didn’t appreciate how versatile this appliance was until I left the country for college. A tiny two-cup rice cooker kept me fed in my cramped 250-square-foot Tokyo apartment. It was programmable, so I could wash my rice, stick it in the cooker, and know that when I woke up late for class, I could still whip up some ochazuke or oatmeal for a quick, cheap, and nutritious breakfast. (It also took the hassle out of steel-cut oats.) Whenever I had a craving for sweets, it was so easy to take pancake mix and bake a Japanese-style cheesecake for one. I’ve since graduated to a 5.5-cup Zojirushi Micom Rice Cooker, and it’s one of the handiest tools I have for meal prepping. When I was sick this past winter, I made ample use of its porridge setting to make a congee-type dish with chicken and ginger — just like my mom used to make when I was a kid. The fact that it’ll keep something warm for days, meant I could crawl out of bed, scoop out some porridge, and crawl back into bed with minimal effort. When I’m feeling lazy, I throw eggs in there, and bam — some extra hard-boiled protein. Mine also comes with a little basket, so it’s super easy to throw in veggies or steam frozen dumplings. But what I like most is that rice cookers are more space-efficient than Instant Pots. In my kitchen, the one spot where I could fit an Instant Pot is instead occupied by a rice cooker, blender, and spoon rest. A multitasking kitchen gadget that doesn’t take over your entire counter? That’s a must if you live in a small space. Amelia Holowaty Krales, senior photo editor A solid, basic toaster oven that fits four slices of toast or a nine-inch pizza. I love a toaster oven! It’s compact, works fast, and is perfect for reheating pizza, making nachos, and yes, even toast. I use my toaster oven more than my regular oven for sure — and probably more than any other item in my kitchen. I have a pretty basic model like this one, but these days, many come with other features, like air frying and convection oven capabilities.  Emma Roth, news writer Keep food fresh by squeezing all the air out of the package and sealing it for long- or short-term storage. I never knew how much I needed a vacuum sealer until I actually got one. I’m the type of person who shops at wholesale clubs despite only needing food for two people, so when I buy meat, I get a lot of it all at once, some of which inevitably gets stored in my fridge or freezer. That’s where my vacuum sealer comes in. While I can’t speak to the quality of other vacuum sealers, the FoodSaver I have is awesome. Not only does the thing help keep raw meat and other food fresher for longer in the fridge but it also helps save space in the freezer (each package of meat becomes much flatter when all the air is sucked out of it). With this little machine, I can load up whatever I want in one of the FoodSaver bags, insert the open end into the machine, which vacuums up all the air and then closes the bag using its heat sealing feature in one fell swoop. It’s pretty neat! –  Kaitlin Hatton, audience manager Expandable backpack that comes with a lot of storage space and packing cubes. Earlier this year, I committed to traveling more, and so I took a look at the gear I had that could be replaced after years of trekking the globe. My ratty old secondhand carry-on bag was the first thing to be replaced. After several days of weighing the pros and cons of various travel bags, I stumbled upon this Lumesner carry-on backpack on Amazon, and it fit all of my needs. It can carry a laptop, several days’ worth of clothes, my 40oz Hydro Flask bottle, and more. The bag even includes some packing cubes. It’s very comfortable, and the weight is well distributed when it’s completely full. It’s an inexpensive alternative to many name-brand carry-on bags, too. So far, I’ve used it on a handful of trips, and the quality has held up. It also holds onto pet fur, though, so I had to add a small lint roller to my travel necessities. But that’s just life while traveling with a dog anyway.  Sarah Jeong, deputy features editor This all-in-one 20W USB C power cube boasts three AC outlets, two USB-A ports, and one USB-C port. Nobody wants to carry a power strip or an extension cord with them on their vacation. It’s probably unnecessary if you’re staying in relatively modern buildings and definitely unnecessary if you’re camping. But sometimes you want to stay in a charming historical hotel or a lovely cabin in the woods, and it’s only when you go to charge your devices at night that you realize that the only electrical socket in the bedroom is in the corner farthest away from the bed and there’s already two lamps plugged into it.  Older buildings especially suffer from what I can only describe as loose socket syndrome, where those very convenient modern boxy socket extenders with five different USB and USB-C charging ports simply cannot stay in place and fall right out of the wall because they’re too heavy. After one (totally pleasant) vacation where I had to charge my phone, watch, AirPods, and laptop in a weird corner of my room with the plug-in charging hub propped up on a strategically balanced mountain of books and sham pillows, I bought this Anker combination extension cord / power strip. It’s not a full power strip — just a cube with a few sockets along with USB and USB-C charging ports at the end of a five-foot cable. I’ve brought it on a few trips since then. It takes up extra space in my suitcase but each time has left me feeling vindicated about the purchase.  The three prongs at the end of the cable are static, rather than folding flat for easy packing. This is key because the loose sockets of older buildings reject the beautiful convenience of folding prongs. There are more than enough sockets for one person, and with some finagling (and maybe an extra charging brick), it can accommodate two people’s devices. If you’re traveling overseas, don’t forget to purchase a different plug type for the region you’re going to or pack an adapter.  Victoria Song, senior reviewer Epicka’s Universal Travel Adapter is an all-in-one adapter that includes four different plugs that cover over 150 countries. In my youth, I forgot to pack plug adaptors for international trips one too many times. Buying them once you’ve landed in another country isn’t always easy, either. And if you’re like me, your relatives in rural Korea don’t always have more than one plug for your American devices — in which case, you’ll have to share with your six other cousins. Nope. Absolutely not. Which is why I never leave this country without a universal travel adaptor. Basically, it’s six plug adaptors in one. Depending on which one you get, it might come with USB ports so you can charge multiple devices in one outlet. Granted, it’s bulkier than buying one or two specialized adaptor plugs, but if you’ve got a multi-continent itinerary, it’s a game-changer. What I like about this one from Epicka is that it comes with a spare fuse in case things go sideways with voltage. The only caveat is that, although it says “universal,” it’s technically only the four most common types of plugs. That’ll get you by in most countries, but it’s not a guarantee in places like Brazil, South Africa, or India. Even so, I’ll take this over price gouging at airport electronics shops or having to take time out of my schedule to visit a local hardware store. David Pierce, editor-at-large Apple’s wired earbuds are comfortable, provide fine audio, and includes a built-in remote. Here’s a little-known fact about Apple’s wired headphones: outside of a professional microphone, they’re probably the best gadget on the planet for sounding good on phone and video calls. Add in the fact that their battery never dies (because they don’t have one!) and the fact that they’re more comfortable to have in your ears for hours than any of the AirPods, and the old-fashioned EarPods are a staggeringly useful accessory.  You can get EarPods with a Lightning jack for your iPhone or a 3.5mm jack for everything else on Earth. Heck, they’re under $20, get both! I have a set in my suitcase (for emergency plane-screen situations), a set in my backpack, and a set in my car. If you ever call me and think gosh, David sounds so great, there’s only one reason for it: wires. Becca Farsace, senior producer An SD, microSD, and SIM card holder with a built-in 3.1 USB-C card reader and SIM card removal tool.  As a video person who is constantly on the move, there is nothing better than the consolidation of gear — especially when it pertains to dongles. So when fellow video extraordinaire Vjeran Pavic (The Verge’s supervising producer) recently surprised me with a very cute birthday note and this magical little gadget, I was elated.  And if that wasn’t enough, it has a carabiner hook. It is everything I have ever wanted in a rubber case and more. To have both my SD card reader and all my cards in one place is priceless (well, actually $39.95). Thank you, Vjeran. <3 Mitchell Clark, former news writer The ChomChom is a reusable cat and dog hair remover that works great for furniture. The ChomChom pet hair remover is an extraordinarily simple device — it’s basically a couple of pieces of plastic, fabric, and rubber. But through some dark magic, it’s better at getting cat hair off my couch, cat tree, and other upholstery than even the adhesive-laden lint rollers (though those are still superior if the thing you’re trying to de-pet is yourself). I’d explain more, but honestly, I think the ChomChom can best be explained with this GIF: I know I’m stretching the definition of “tech” here, but I just had to share the ChomChom because the first time I saw someone use it, my jaw dropped. I hope it can change your life like it did mine. (Note: as far as I can tell, the limited-edition cat ChomChom that I paid extra for is 0 percent more functional than the regular one. It was still worth it, though.) Elizabeth Lopatto, senior reporter Calming donut furry bed for cats and dogs. Jeeves loves to be in the office with me while I work. (I assume she’s supervising.) Anyway, to make her cozier, I got her this fuzzy cat bed. At first, she was afraid of it — she’s extremely shy around new people and objects — but now, a year later, it’s her favorite place to sit that isn’t my lap. Usually, she spends the afternoon snuggled up in it. Kaitlin Hatton, audience manager Plush duck squeaky dog toy. Trudee, otherwise known as My Boss, is notoriously insistent on being the focus of my attention. At any given moment, she has 20 toys strewn about my apartment, but she will not play with them unless I’m watching her — like literally, no distractions, sitting within feet of her, just staring at her chew on her toys for hours on end. Don’t get me wrong. I love staring at my dog, but she doesn’t get the enrichment she deserves when her activity levels are tied directly to my ability to give her undivided attention. That is, until I bought the Pet Fit For Life Plush Wand. It has a toy attached to a long chewable rope that is suspended from a metal pole. Now, I not only toss the toy about the room from the comfort of my couch but also Trudee is so distracted by chasing it that she doesn’t notice if I am not making direct eye contact. It’s a win-win. Helen Havlak, publisher A three-tiered puzzle that amuses your cat while it slows their eating. Despite many standoffs in pursuit of an acceptable wet food, our cat Olivia remains addicted to dry food. Last year, I recommended the Catit Senses 2.0 slow feeder, a pedestal with five plastic cups that slows down her eating pace.  This year, my in-laws gifted us the even more intense sequel, the Catit Design Senses food maze. This is a three-level tower that you load from the top; your cat then has to reach in with their paw to move food down each level. It’s intense! I would estimate that it takes her about three times as long to finish a meal in the tower as in her older slow feeder. Jennifer Pattison Tuohy, reviewer Set up alerts and quickly track your pet; also monitor your pet’s day-to-day activity. As a puppy, my Wirehaired Pointing Griffon, Gus, was the consummate escape artist. He could leap our five-foot-high fence in a single bound and often would if a dog, squirrel, or leaf happened to catch his eye. The Whistle Go Explore location tracker saved his furry butt a few times, first alerting us to his escapade (when the device disconnects from your Wi-Fi, you get an alert), then helping us track him down with its GPS location tool.  As he’s gotten older and lazier, it’s been a helpful tool for ensuring he’s getting enough exercise. Essentially a Fitbit for pets, the Whistle tells us how many steps he’s taken and how many calories he’s burned. It also has some neat health features on board thanks to an accelerometer that can track how much drinking, licking, scratching, and sleeping he’s doing. This info actually helped us realize that the poor boy has terrible seasonal allergies, and he’s now on a daily Zyrtec regimen and much happier for it.  The downside is the $99 annual subscription fee, which is required to use the device. This does include GPS tracking, but I admit I let my plan lapse in my last round of budget cuts. (I’m currently looking into Whistle’s health tracker, which ditches GPS for a lower $40 annual fee).  Antonio G. Di Benedetto, commerce writer Automatic cat litter box with multiple sensors to keep things neat and odor-free. We have two cats, Pouncey and Oscar, who have always shared a litter box. Oscar, the younger one, is quite messy — jumping out of the box with reckless abandon and spreading litter all over. We initially had a covered box to slightly circumvent this, but last year, we opted for a pricey self-cleaning one to keep things tidier. (It was on sale for a little more than $400 then.) Like much smart home tech, it’s excellent in some ways and not so great in others. I love that I’m no longer scooping litter every day, and if we ever go on a trip, we don’t have to ask friends or family to handle poop duties in addition to feedings. But it’s a blessing and a curse because, if I don’t empty out the waste bin on time, it piles up too high. Ever try opening a jam-packed kitchen drawer with a ladle sticking up inside it? You know that sense of frustration when it hits the top of the frame and the drawer gets stuck? Picture that, but instead, it’s clumped-up cat pee smearing across the underside as you pull it out. Yeah, not ideal. So it handles the daily duties, but it keeps me on schedule, or I end up wrist-deep in the other doodies.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. Update October 11th, 8:55AM ET: Added two entries, and updated product cards with slightly revised pricing.  / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily. The Verge is a vox media network © 2023 Vox Media, LLC. All Rights Reserved", "Summary": "Amazon is currently offering deals on tech, kitchen tools, travel aids, and pet toys. Here are some of our staff’s most-liked gear and gadgets. For more deals we recommend across all categories, check out our full roundup here. If you buy something from a Verge link, Vox Media may earn a commission. The Slice Blade Micro Ceramic Ceramic Safety Cutter is available on Amazon for $9.99. It has a small blade that cuts through paper packaging and is easy to use. It also charges over USB-C and has a handy light when it turns on to help you see where you’re screwin’. For $35, you get a screwdriver with a plastic and a metal spudger, tweezers and a suction cup."}]